sw-rails/app/views/matches/show.html.erb

                <% (1..27).each do |ordinal| %>
                  <%= ball_td(inns.balls.select{|b|b.ordinal == ordinal}[0]) %>
---
SELECT "balls".* FROM "balls" WHERE ("balls".batsman_innings_id = 86)

  <tbody>
    <% @match.overs.each do |over| %>
---
SELECT "overs".* FROM "overs" WHERE ("overs".match_id = 11)