sw-rails/app/controllers/matches_controller.rb

SELECT "matches".* FROM "matches" WHERE "matches"."id" = 11 LIMIT 1
---
  def show
    @match = Match.find(params[:id])